#include "aws_data.h"

kma_data_t kma_data_1s;


sensor_emul_t g_sensor_emul[SENSOR_LIST_MAX];


const char *sensorNameList[SENSOR_LIST_MAX]={ 
"기온",//0
"풍향",//1
"풍속",//2
"순간풍향",//3
"순간풍속",//4
"강수량",//5
"기압",//6
"강수유무",//7
"적설",//8
"상대습도",//9
"강수량(0.1mm)",//10
"일사",//11
"일조",//12
"지면온도",//13
"초상온도",//14
"지중온도 5cm",//15
"지중온도 10cm",//16
"지중온도 20cm",//17
"지중온도 30cm",//18
"지중온도 50cm",//19
"지중온도 1.0m",//20
"지중온도 1.5m",//21
"지중온도 3.0m",//22
"지중온도 5.0",//23
"층운고",//24
"2층운고",//25
"3층운고",//26
"운량",//27
"시정",//28
"PM10",//29
"PM2",//30
"순복사",//31
"전천복사",//32
"반사복사",//33
"직달",//34
"현재일기",//35
"토양수분 10cm",//36
"토양수분 20cm",//37
"토양수분 30cm",//38
"토양수분 50cm",//39
"조도량",//40
"풍속(1.5m)",//41
"풍속(4.0m)",//42
"순간풍속(1.5m)",//43
"순간풍속(4.0m)",//44
"기온 0.5m",//45
"기온 4.0m",//46
"습도 0.5m",//47
"습도 4.0m",//48
"타코미터",//49
"사용자 1",//50
"사용자 2"//51
};


const char *dataFmtList[SENSOR_LIST_MAX]={ 
"%-5.2f도",  //기온 0
"%-6.2f각도",//풍향      1
"%-5.2fm/s", //풍속      2
"%-6.2f각도",//순간풍향  3
"%-5.2fm/s", //순간풍속  4
"%-dmm",     //강수량    5
"%-5.2fbar", //기압      6
"%-d",       //강수유무  7
"%-dmm",     //적설      8
"%-5.2f",    //상대습도  9
"%-dmm",//강수량(0.1mm)",//10
"%d",//일사",//11
"%d",//"일조",//12
"%d",//"지면온도",//13
"%d",//"초상온도",//14
"%d",//"지중온도 5cm",//15
"%d",//"지중온도 10cm",//16
"%d",//"지중온도 20cm",//17
"%d",//"지중온도 30cm",//18
"%d",//"지중온도 50cm",//19
"%d",//"지중온도 1.0m",//20
"%d",//"지중온도 1.5m",//21
"%d",//"지중온도 3.0m",//22
"%d",//"지중온도 5.0",//23
"%d",//"층운고",//24
"%d",//"2층운고",//25
"%d",//"3층운고",//26
"%d",//"운량",//27
"%d",//"시정",//28
"%d",//"PM10",//29
"%d",//"PM2",//30
"%d",//"순복사",//31
"%d",//"전천복사",//32
"%d",//"반사복사",//33
"%d",//"직달",//34
"%d",//"현재일기",//35
"%d",//"토양수분 10cm",//36
"%d",//"토양수분 20cm",//37
"%d",//"토양수분 30cm",//38
"%d",//"토양수분 50cm",//39
"%d",//"조도량",//40
"%d",//"풍속(1.5m)",//41
"%d",//"풍속(4.0m)",//42
"%d",//"순간풍속(1.5m)",//43
"%d",//"순간풍속(4.0m)",//44
"%d",//"기온 0.5m",//45
"%d",//"기온 4.0m",//46
"%d",//"습도 0.5m",//47
"%d",//"습도 4.0m",//48
"%d",//"타코미터",//49
"%d",// "사용자 1"//50
"%d" // "사용자 2"//51
};


sensor_data_t sensor_data[SENSOR_LIST_MAX];


void sensorData_init(void)
{
  sensor_data[A1_TEMPERATURE].dataType = DATA_TYPE_F;
  sensor_data[A2_WIND_DIRECTION].dataType = DATA_TYPE_F;
}