#include "aws_data.h"

kma_data_t kma_data_1s;


sensor_emul_t g_sensor_emul[50];


const char *sensorNameList[]={ 
"기온",//0
"풍향",//1
"풍속",//2
"순간풍향",//3
"순간풍속",//4
"강수량",//5
"기압",//6
"강수유무",//7
"적설",//8
"상대습도",//9
"강수량(0.1mm)",//10
"일사",//11
"일조",//12
"지면온도",//13
"초상온도",//14
"지중온도 5cm",//15
"지중온도 10cm",//16
"지중온도 20cm",//17
"지중온도 30cm",//18
"지중온도 50cm",//19
"지중온도 1.0m",//20
"지중온도 1.5m",//21
"지중온도 3.0m",//22
"지중온도 5.0",//23
"층운고",//24
"2층운고",//25
"3층운고",//26
"운량",//27
"시정",//28
"PM10",//29
"PM2",//30
"순복사",//31
"전천복사",//32
"반사복사",//33
"직달",//34
"현재일기",//35
"토양수분 10cm",//36
"토양수분 20cm",//37
"토양수분 30cm",//38
"토양수분 50cm",//39
"조도량",//40
"풍속(1.5m)",//41
"풍속(4.0m)",//42
"순간풍속(1.5m)",//43
"순간풍속(4.0m)",//44
"기온 0.5m",//45
"기온 4.0m",//46
"습도 0.5m",//47
"습도 4.0m",//48
"타코미터"//49
};